In [1]:
import numpy as np
import pandas as pd

In [2]:
s1 = pd.Series([0.25, 0.50, 0.75, 1.0])

In [5]:
print(s1.values)
print(s1.index)

[0.25 0.5  0.75 1.  ]
RangeIndex(start=0, stop=4, step=1)

In [7]:
s1[1]

0.5

In [9]:
s1[:3]

0    0.25
1    0.50
2    0.75
dtype: float64

In [3]:
s2 = pd.Series([0.25, 0.5, 0.75, 1.0],
              index=['a', 'b', 'c', 'd'])

s2[:'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [15]:
ds = pd.Series({100: 1, 200: 3, 400:5})
ds.index

Int64Index([100, 200, 400], dtype='int64')

In [16]:
ds.values

array([1, 3, 5], dtype=int64)

In [21]:
df = pd.DataFrame([[1,2,3], [4, 5, 6]])
df

   0  1  2
0  1  2  3
1  4  5  6

In [22]:
print(df.index)
print(df.columns)

RangeIndex(start=0, stop=2, step=1)
RangeIndex(start=0, stop=3, step=1)

In [32]:
df2 = pd.DataFrame(np.ones((4,2)),
            index=['a', 'b', 'c', 'd'],
            columns=['one', 'two'])
df2

   one  two
a  1.0  1.0
b  1.0  1.0
c  1.0  1.0
d  1.0  1.0

In [31]:
print(df2.index)
print(df2.columns)

Index(['a', 'b', 'c', 'd'], dtype='object')
Index(['one', 'two'], dtype='object')

In [37]:
df2["three"] = np.arange(4)

In [39]:
df2

   one  two  three
a  1.0  1.0      0
b  1.0  1.0      1
c  1.0  1.0      2
d  1.0  1.0      3

In [41]:
df2.pop('three')

a    0
b    1
c    2
d    3
Name: three, dtype: int32

In [43]:
df2

   one  two
a  1.0  1.0
b  1.0  1.0
c  1.0  1.0
d  1.0  1.0

In [51]:
s2.index = [0, 1, 2, 3]
pd.DataFrame({"Column 1": s1, "Column 2": s2})

   Column 1  Column 2
0      0.25      0.25
1      0.50      0.50
2      0.75      0.75
3      1.00      1.00

In [49]:
print(s1)

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [50]:
print(s2)

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [54]:
ind = pd.Index([2, 3, 5, 7, 11])
s3 = pd.Series(['one', 'two', 'three', 'four', 'five'],
              index=ind)
s4 = pd.Series(['cat', 'dog', 'fish', 'bird', 'tiger'],
              index=ind)

In [56]:
pd.DataFrame({"Numbers": s3, "Animals": s4})

   Numbers Animals
2      one     cat
3      two     dog
5    three    fish
7     four    bird
11    five   tiger

In [57]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [60]:
#data.loc[1]
data[1]

'a'

In [59]:
data.iloc[1]

'b'

In [63]:
df2['three'] = np.random.randint(1, 100, size=4)
df2

   one  two  three
a  1.0  1.0     50
b  1.0  1.0     52
c  1.0  1.0     52
d  1.0  1.0     78

In [64]:
df2['three']

a    50
b    52
c    52
d    78
Name: three, dtype: int32

In [66]:
df2.loc['b']

one       1.0
two       1.0
three    52.0
Name: b, dtype: float64

In [68]:
df2.iloc[3]

one       1.0
two       1.0
three    78.0
Name: d, dtype: float64

In [70]:
df2[0:2]

   one  two  three
a  1.0  1.0     50
b  1.0  1.0     52

In [72]:
df2.loc['a':'c']

   one  two  three
a  1.0  1.0     50
b  1.0  1.0     52
c  1.0  1.0     52

In [75]:
df2[df2['three'] >= 52]

   one  two  three
b  1.0  1.0     52
c  1.0  1.0     52
d  1.0  1.0     78

In [14]:
df = pd.DataFrame({"One": s1, "Two": s2})

df.loc[0][1] = 100
df

    One     Two
0  0.25  100.00
1  0.50     NaN
2  0.75     NaN
3  1.00     NaN
a   NaN    0.25
b   NaN    0.50
c   NaN    0.75
d   NaN    1.00

In [9]:
df

    One   Two
0  0.25   NaN
1  0.50   NaN
2  0.75   NaN
3  1.00   NaN
a   NaN  0.25
b   NaN  0.50
c   NaN  0.75
d   NaN  1.00

In [20]:
df.fillna(0)

    One     Two
0  0.25  100.00
1  0.50    0.00
2  0.75    0.00
3  1.00    0.00
a  0.00    0.25
b  0.00    0.50
c  0.00    0.75
d  0.00    1.00